package days11;

/**
 * 
 * @author kenik
 * @date 2025. 1. 9. - 오전 10:02:59
 * @subject  시험 요소
 * @content
 */
public class Ex01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*
		 *  1. 객체 지향적 프로그래밍 (OBJECT ORIENTED PROGRAMMING)
		 * 
		 *  완성된 조립 컴퓨터 = 부품 + 부품 + 부품 ...
		 *  
		 *  완성된 프로그램 = 부품 + 부품 + 부품 ...
		 *                (객체) (객체) (객체)
		 *                
		 *                
		 *  객체 == object == 부품 == 개체 == 물건 : 특징(필드) + 기능(일 == 메소드)
		 *  
		 *  객체는 재사용 가능 -> 개발의 효율성을 위해서
		 *  
		 *  
		 *  
		 *  2.  클래스 : 겍체의 설계도
		 *  3.  객체  : 클래스로 실제 존재하는 것. 사물(유형) 또는 개념(무형)
		 *  
		 *  4. 인스턴스 : 생성된 객체를 인스턴스라 한다.
		 *  
		 *     인스턴스화  : 공장에서 설계도면을 보면서 용조ㅂ, 절단, 조립 - > 물건을 만드는 과정
		 *                       클래스 -> 객체를 생성하는 과정
		 *                       
		 *  5. OOP의 특징 ( == 클래스의 특징)
		 *     1) 상속성 ( Inheritance ) 
		 *     2) 캡슐화 ( Encapsulation ) 
		 *        은닉화
		 *     3) 다형성 ( Polymorphism )
		 *     4) 추상화 ( Abstraction )
		 *  
		 *  
		 *  6. 객체의 구성 요소
		 *     1) 객체를 구성하는 요소를 "멤버"라고 부른다.
		 *     3) 특징 ( 속성 ) == property == 멤버변수
		 *        + 기능 ( 일 ) == function == 멤버함수 == 메소드(method)
		 *        
		 *        
		 *  7. 클래스 설계하는 과정 == 클래스를 선언 
		 *     1) 객체의 구성 요소 파악    - > 목록 작성

		 *     ( 특성 (필드), 기능(메서드) )  
		 *     2) 클래스 선언
		 *     [접근지정자] [기타지원자] class 클래스명 [extends 부모(Super) 클래스] [implements 인터페이스 {
		 *          
		 *          // 클래스 구서 요소
		 *          // 1) 필드
		 *          // 2) 메소드 
		 *     
		 *       }
		 *       
		 *     3) 객체 생성 - 테스트 
		 *     4) 문제점 파악 - 유지, 보수 
		 *     5) 상용화
		 *     6) 기능 추가, 확장 - 버젼 관리
		 *     
		 *  8. 자동차 클래스 설계
		 *     1) 객체 구성요소 파악 (필드, 메소드 목록 작성)
		 *        전기 
		 *        스포츠카
		 *        알루미늄바디
		 *        3도어 
		 *        가로 * 세로 
		 *        엔진
		 *        18인치 휠+ 타이어 장착                                               
		 *        등등 
		 *        
		 *     2) 클래스 선언
		 *     3) 객체 생성
		 *        
		 *  예) 건축설계사 : 설게도 
		 *      시공사 업체
         *          ㄴ 기초공사
         *          ㄴ 철근
         *          ㄴ 배선
         *          ㄴ 미장
         *          ㄴ 등등    
		 *    
		 *    
		 *    
		 * 
		 * 
		 */
	} //main

} //class
